#Пользователь вводит предложение, заменить все пробелы на "-" 2-мя
#способамиi
sentence = input("Input sentence: ")
r_sentence = sentence.replace(" ","-")
print(r_sentence)
print(sentence.replace(" ","-"))